{
    "info": {
        "name": "Yue Wu",
        "email": "yuw264@ucsd.edu",
        "phone": "(858) 666-5847",
        "website": "https://almsivi.github.io",
        "github": "https://github.com/ALMSIVI",
        "linkedin": "https://www.linkedin.com/in/yuewu-almsivi"
    },
    "comments": {
        "position": "I am currently looking for Software Engineer internship opportunities for Summer 2021.",
        "include": false
    },
    "education": {
        "name": "University of California, San Diego",
        "bs": "B.S. in Computer Science, graduated with university latin honors",
        "bsdate": "09/2016-06/2020",
        "bsgpa": "3.92/4",
        "ms": "M.S. in Computer Science",
        "msdate": "09/2020-12/2021",
        "msgpa": "3.89/4",
        "courses": [
            "Data Structures",
            "Algorithms",
            "Software Engineering",
            "HCI Design",
            "Computer Graphics",
            "Operating Systems",
            "Programming Languages",
            "Compilers",
            "Deep Learning",
            "Network",
            "Databases"
        ]
    },
    "skills": {
        "language": [
            { "name": "Javascript/Typescript", "level": 5 },
            { "name": "Java", "level": 5 },
            { "name": "Python", "level": 5 },
            { "name": "C#", "level": 5 },
            { "name": "HTML", "level": 5 },
            { "name": "CSS", "level": 4 },
            { "name": "C/C++", "level": 4 },
            { "name": "LaTeX", "level": 5 },
            { "name": "Shader (GLSL/HLSL)", "level": 5 }
        ],
        "framework": [
            { "name": "Unity", "level": 5 },
            { "name": "React", "level": 5 },
            { "name": "Spring", "level": 4 },
            { "name": "Node", "level": 5 },
            { "name": "Express", "level": 5 },
            { "name": "MongoDB", "level": 5 },
            { "name": "WPF", "level": 3 },
            { "name": "Android", "level": 3 },
            { "name": "jQuery", "level": 5 },
            { "name": "SQL", "level": 4 },
            { "name": "OpenGL/WebGL", "level": 5 },
            { "name": "THREE.js", "level": 5 }
        ],
        "software": [
            { "name": "vim", "level": 5 },
            { "name": "git", "level": 5 },
            { "name": "Linux", "level": 4 }
        ]
    },
    "work": [
        {
            "position": "Software Engineer Intern",
            "company": "Okta, Inc.",
            "location": "Bellevue, Washington",
            "date": "06/2021-09/2021",
            "image": "okta.png",
            "hide": false,
            "bullets": [
                "Designed and implemented a back end metadata-driven dynamic UI generation module that would create different UI layouts based on app and user settings, automating the development process and improving code reuse and diagnostic capabilities.",
                "Published public validation API endpoints by adopting JSON schema, thus separating data model and its validation schema."
            ]
        },
        {
            "position": "Research Assistant",
            "company": "UC San Diego Health",
            "location": "San Diego, California",
            "date": "10/2020-04/2021",
            "image": "UCSDHealth.jpg",
            "hide": false,
            "bullets": [
                "Helped on a research project about Schizophrenia by putting patients under VR scenarios and studying their brain activities.",
                "Optimized the existing VR application to satisfy timing and measurement constraints, reducing audio lag from >100ms with a high variability to a consistent 35ms latency.",
                "Created new VR scenarios and added audio paradigms, allowing for more comprehensive tests and better data."
            ]
        },
        {
            "position": "Unity Developer",
            "company": "UCSD Qualcomm Institute",
            "location": "La Jolla, California",
            "date": "10/2018-06/2021",
            "image": "QI.png",
            "hide": false,
            "bullets": [
                "Led a small team to build an iOS AR app for PricewaterhouseCoopers (PwC)'s Bodylogical software.",
                "Designed three visualization modules in Unity (AR Foundation) that would present data in 3D space across different time frames, allowing the user to easily grasp the core functions of the software.",
                "Implemented an XML-based localization system and a tutorial system from scratch so that PwC can demonstrate the app to non English speakers who might be new to AR."
            ]
        },
        {
            "position": "Intern Data Visualization Engineer",
            "company": "Alibaba Group",
            "location": "Hangzhou, China",
            "date": "06/2019-08/2019",
            "image": "Alibaba.png",
            "hide": false,
            "bullets": [
                "Constructed a Typescript-based backend 3D graph layout library to be integrated into Alibaba's internal tool chain, where I incorporated force-directed layout and Sugiyama algorithm.",
                "Developed a geographic model generation service featuring a Marching Square algorithm 100x more precise than turf.js, to be deployed for press conferences and exhibitions.",
                "Collaborated with a naked eye 3D project team to discover data visualization and human-computer interaction in Unity and WebGL, where I refactored the code in a data-oriented manner to boost performance with large amounts of data."
            ]
        },
        {
            "position": "Intern Full Stack Developer",
            "company": "LMT Technology",
            "location": "Shanghai, China",
            "date": "06/2018-08/2018",
            "image": "LMT.jpg",
            "hide": true,
            "bullets": [
                "Refactored company's product from Flash to HTML/Javascript, and from a custom backend to Spring, reducing code length and improving execution efficiency.",
                "Pinpointed and addressed problems in localization and responsive UI, making the product more user-friendly under different screen sizes and languages."
            ]
        }
    ],
    "projects": [
        {
            "name": "Exteractive",
            "position": "Full Stack Developer",
            "date": "07/2020-10/2020",
            "link": "https://github.com/ALMSIVI/exteractive",
            "hide": false,
            "bullets": [
                "Developed an interactive story web app, with React as front end, Express as back end, and MongoDB as the database.",
                "Constructed the React framework from scratch with Webpack and Babel, and set up jest to test each component.",
                "Separated routes, controllers and database objects, decoupling the code and making the infrastructure easily extensible."
            ]
        },
        {
            "name": "MechSuit VR",
            "position": "Unity Developer",
            "date": "04/2017-06/2019",
            "link": "https://github.com/TritonXR/Mechsuit-VR",
            "hide": false,
            "bullets": [
                "Joined the school's Virtual Reality Club to work on a Unity fighting game featuring Steam VR and the HTC Vive headset.",
                "Implemented an inverse kinematic system for the player using the positions of the VR headset and hand-held controllers, employing several heuristics to improve player experience and controls.",
                "Programmed a propulsion system with player movements as input, enabling motion control for players, who would physically move to traverse instead of using the joystick.",
                "Designed health and weapon systems, and UI for health and ammo display using MVC, writing scripts with Strategy Pattern so that they can be easily extended for various damage types and player resistances."
            ]
        },
        {
            "name": "Transracer",
            "position": "Full Stack Developer",
            "date": "04/2018-06/2018",
            "link": "https://github.com/ALMSIVI/TransRacer",
            "hide": true,
            "bullets": [
                "Worked in a 4-person team to create a web application for learning languages, built with Bootstrap and jQuery as front end and Express as back end.",
                "Developed all the database logic with sqlite, so that users can upload custom contents to the server for practice, and review their past attempts.",
                "Improved the scoring algorithm, taking multiple user inputs into account so they could have a more precise idea of their performance."
            ]
        },
        {
            "name": "Flashback Music",
            "position": "Android Developer",
            "date": "01/2018-03/2018",
            "link": "https://github.com/ALMSIVI/FlashbackMusic",
            "hide": true,
            "bullets": [
                "Worked in a 5-person, Agile team to create an Android music application that records the time and location songs are played so that users could reminisce on their moods.",
                "Separated UI interaction and back end logic with Model-View-Controller, resulting in cleaner, more flexible code.",
                "Devised separate logic for local and cloud music under a unified set of interfaces with Strategy and Factory patterns."
            ]
        },
        {
            "name": "WayAround",
            "position": "Front End Developer",
            "date": "01/2018-03/2018",
            "link": "https://github.com/ALMSIVI/wayaround",
            "hide": true,
            "bullets": [
                "Worked in a 4-person team to create a web application mockup, with a fully functional front end with Bootstrap and jQuery.",
                "After paper prototypes, implemented two versions of the home page and conducted A/B testing, analyzing the navigation time to research user behavior and modifying accordingly to make the page user-friendly.",
                "Perfected the review page, utilizing Javascript and CSS effects for component animations."
            ]
        }
    ]
}
