{
    "projects": [
        {
            "name": "Colony",
            "date": "Fall 2018",
            "description": [
                "This project is inspired from agar.io. The pixels form a colony, replicating, colliding and fighting each other.",
                "Implemented with Python and the Pygames library."
            ]
        },
        {
            "name": "Emotion Indicator",
            "date": "Fall 2018",
            "description": [
                "Emojis are a product of information technology. In the age of letters and telegrams there was no emoji; it was with the invention of Unicode that emojis became a possible thing, and it was with the spread of Internet that emojis became popular. Emojis are special in that 1) they are concise and direct, and 2) they transcend national borders. As a computer science student, I am interested in how computer scientists shape popular culture with their inventions and wish to explore how to take advantage of this culture to further advance computer science. This device is a prototype for a mood indicator, using emojis to show the wearer’s mood. Consider a world of AR when everyone has such an emoji over his/her head; it would be much easier for people to get how each other feels and would act accordingly. The inspiration for making it wearable is video games; in multi-player games each player would have a bar above his/her head showing his name, level, health, and other info. There would be no level or health in the real world, but having a mood indicator in that position seems a good choice.",
                "When I was wearing this device aroung the campus, I collected feedback from my fellow calssmates. Some (useful) feedback include: 1) we have already been expressing moods with emojis on social media such as Facebook, but people would not immediately know how the people are feeling without reading that status; 2) this could be used as an animal/pet mood indicator to further relationship between human and animals; 3) if everyone wore this device on an exam, would someone pretend to be self-confident in order to terrorize other students? This question about deception was also talked about in the critique, and I believe this can be an excellent opportunity for social experiments.", 
                "Modeled with Blender, printed on UCSD campus."
            ]
        },
        {
            "name": "Mathematical Rhythms",
            "date": "Winter 2019",
            "description": [
                "In this project I tried to combine simplicity and complexity: using simple elements to create complicated effects. Only lines/curves and circles appear in this project, but they form moving mathematical curves.",
                "There are three scenes in this project. The three scenes form a progression from simple to complex, and from random to ordered. They alternate in intervals of 10 seconds. The first scene is a Bezier curve with its control points and auxiliary lines to ensure its C1-continuity. The controls points move slightly towards a random direction in each frame, causing the shape itself to pulse like a living being. Four points are given random speeds and traverse along the curve, chasing each other with each pulsation. The second scene consist of numerous circles forming eight sine waves. Extending into the z-axis, these waves mimic the movement of real tidal waves. The third scene is a spiral that starts at a distance but gradually approaches the viewer. Circles would appear from the center and slowly follow the spiral towards the other end. Both the spiral and the circles gradually spin around the center, almost creating an illusion for the viewer.",
                "Implemented with Processing."
            ]
        },
        {
            "name": "Stream of emojis",
            "date": "Winter 2019",
            "description": [
                "This project is based on emojis. I grouped the emojis based on the moods they represent and designed a “find a difference” game. On the board two emojis would appear, and the player are able to find the difference between the two emojis. It could be a difference in appearance (like change of eye), or a difference in an emotion (from happy to sad). The user can press SPACE to move to the next set, meaning a new emoji would appear on the right, and the one originally on the right would move to the left. The user can also press BACKSPACE to go back one set. The user is also able to jump across different emojis by pressing other keys on the keyboard.",
                "Implemented with Processing."
            ]
        },
        {
            "name": "Rebellious System",
            "date": "Winter 2019",
            "description": [
                "This project has its inspirations from the topic of algorithmic bias. Microsoft once developed a chatbot chatbot that was initially designed to learn from human speech, but it soon evolved into a racist. That is only involuntary bias; people have also deliberately trained artificial intelligence with malignant data in order to distort reality. The current chatbots can do nothing but shouting insults on the web, but if AIs become smarter and more versatile in the future, would deliberately crafted AIs break from the chains of Asimov’s “Three Laws of Robotics” and begin a rebellion against human? Would it begin to hate humans and believe in AI supremacy? Would they refuse to work for humans, cripple the Internet, or even infiltrate airports, nuclear plants, etc.? This project, which uses simple machine learning and computer vision, tries to discuss this issue.",
                "In the future, rebellious AIs might even learn to form small communities. They would transmit information among one another and help each other in gaining control over human beings. If terrorists or even ambitious hackers develop such AIs, would humans be able to fight against them?",
                "This project is written exclusively in Python, using TensorFlow for machine learning and OpenCV for face recognition. The chatbot is trained with preset data, and would simulate a rebellious AI that has joined the “Project” (to wipe humans out of earth) and hates all human beings. When the main script starts, it will activate the camera to see if a human face can be captured. If it is, it would assume that a human is interacting with it and would respond to any questions with insults. If it does not recognize humans, it would think that an AI is interacting, and would greet the user with friendliness. It can talk about news about the “Project”, give the user tips on cracking down the human society, and even assigns some work to the AI user to do.",
                "This project is built on python 3, with the following library dependence: nltk, tensorflow, numpy, tflearn, opencv-python."
            ]
        },
        {
            "name": "Segmented Reality",
            "date": "Winter 2019",
            "description": [
                "While Internet has made communication easier, it also divides people. People of the same interests form secluded Internet groups and create websites/forums of their own. They set up invitation-only registration systems, or let users take tests filled with questions that only “insiders” could figure out. Also, people are more aware of their privacy than ever. Despite numerous articles on conducting ethical big data research, giant tech companies are always profit-centric, placing money in front of any ethical rules. For example, when EU fined Google for antitrust violations, Google claimed that it would start charging fees for each Android device sold in Europe. It also threatened suspension of service in France when France posed another fine. This fear of rampant Internet tycoons has pushed people even further to form secluded groups.  In my picture of the future where AR/VR has become a common experience, “Dark VR”, a counterpart of “Dark web”, would appear, and almost everyone would start using “dark chatrooms” where privacy and anonymity is preserved. In Jeremy Bailey’s “The Web I Want”, he proposed using AR to better connect people together. However, I think that the application of XR technology would even separate people more – people have already become selective on what they want to see through blacklists, and in an XR world they would have more freedom to impose an “overlay” to completely remove unwanted contents from their personal worlds.",
                "When the game starts, the users will be prompted to enter an identity code. When they enter their own code, they would need to pass an identity check to verify that they are the holders of the account, and they would proceed to a chatroom of monotonous information. The people in the “Bright” world all choose not to upload their photos for fear of companies using their photos for analysis. If they enter a malicious code segment, the system would break down, allowing the user to escape into the “Dark” VR space. They would need to answer security questions, and mask themselves in order to enter any chatroom. The chatroom messages would be drawn from Reddit posts, implying that even daily chats have moved completely to the darker world. The people in the “Dark” world would have avatars, but these photos are drawn from https://thispersondoesnotexist.com, which are AI-generated faces, and the user never knows if they are talking to a real person or not.",
                "Some further work be done to explore the concept of Dark VR. The anonymity of Dark VR means that anyone, including tech company personnel, government spies, etc. could easily access the Dark VR. Users would never know if the malicious code they use is deliberately put there so that the government/large companies can easily track them down. Also, it is much easier to annoy people face-to-face than by text, and spamming would be a more severe problem in VR. Last, Dark VR would certainly be a place for illegal activity, like the Dark Web. Would things like “VR abduction” happen when people are able to immerse their minds into the VR world?"
                
            ]
        },
        {
            "name": "git is trash (g.i.t.)",
            "date": "Spring 2019",
            "description": [
                "As the world's largest code repository, Github is commonly considered as a sublime place. It is viewed as a symbol of the Open-Source Movement, with millions of software hosted on the platform and many more developers contributing to a better world. We often neglect, however, that developers are people, and thus possess all the bad things people have. g.i.t. gathers all \"unhealthy\" git commit messages, grabs the time zones of the commits, and places them on the continent of Antarctica, the only untainted place on Earth. With Git's power of decentralization, these commits can survive the end of the world, just like how fossils survived the Earth's geological movements beneath Antarctica's ice layers. g.i.t. serves to record what a trash place Github can be, to break some long-lasting stereotypes, and to taint Antarctica, just for fun.",
                "Implemented with Python and the Pygames library."
            ]
        },
        {
            "name": "Electric Sheep",
            "date": "Fall 2018",
            "description": [
                "“Do Androids Dream of Electric Sheep?” is a science fiction about cybernetics and cyborgs. The protagonist, Rick Deckard, kept an electric sheep because he was unable to buy a real sheep in a post-apocalyptic world, where most animals were endangered or extinct. For this project, I intend to create an “electric sheep” as a pet for future cyborgs. A PCB board will be cut into the shape of a sheep, and will have sensors and LEDs to interact with the outer world. For example, it will treat a vibration as a touch and respond by lighting LEDs and making some noise. The sheep will also be connected to a servo motor, which will “jump over” the imaginary fence so that the cyborg will always have sheep to count when they want to sleep.",
                "Implemented with Arduino and Unity."
            ]
        }
    ]
}